StoneRose35/cortexguitarfx/Src/rp2040/core1Main.cpp
extern "C" {
#include "globalConfig.h"
#include "system.h"
#include "drivers/dma.h"
#include "drivers/multicore.h"
#include "core1Main.h"
#include "drivers/gpio.h"
#include "drivers/irq.h"
#include "drivers/display128x64.h"
#include "avrProgrammer.h"
#include "audio/firFilter.h"
#include "audio/audiotools.h"
#include "audio/delay.h"
#include "pipicofx/fxPrograms.h"
#include "pipicofx/pipicofxui.h"
#include "drivers/adc.h"
#include "stringFunctions.h"
#include "drivers/rotEncoderSwitchPower.h"
#include "drivers/stompswitches.h"
#include "drivers/systick.h"
#include "hardware/regs/addressmap.h"
#include "hardware/regs/sio.h"
#include "hardware/regs/dma.h"
#include "hardware/regs/m0plus.h"
#include "hardware/rp2040_registers.h"
#include "consoleBase.h"
#include "gen/version.h"

}
#include "pipicofx/picofxCore.hpp"
#include "pipicofx/FxProgramLoader.hpp"

extern "C" {
extern volatile uint32_t task;
extern volatile int16_t avgOutOld;
extern volatile int16_t avgInOld;
extern volatile uint8_t fxProgramIdx;
extern volatile uint32_t cpuLoad;
extern volatile uint8_t programsActivated;
extern volatile uint8_t programChangeState;
extern volatile uint8_t programToInitialize;
extern FxPresetType presets[3];
extern uint8_t currentPreset;
extern const uint8_t stompswitch_progs[];
extern PiPicoFXUiType ui;
int16_t avgOldOutBfr;
int16_t avgOldInBfr;
uint8_t cpuLoadBfr;
int16_t encoderDelta;
RotaryEncoderIncrementType rotaryEncoderInfo;
uint8_t switchVals[2]={0,0};
//PiPicoFxUiType uiControllerData;
uint16_t adcChannelOld0=0,adcChannel0=0;
uint16_t adcChannelOld1=0,adcChannel1=0;
uint16_t adcChannelOld2=0,adcChannel2=0;
uint16_t adcChannel=0;
uint8_t stompSwitchState;
volatile uint8_t consumeEnterReleased=0;
FxPresetType preset1, preset2;

extern uint32_t  _binary___mic_stomp_expansion_board_mic_stomp_bin_start;
extern uint32_t  _binary___mic_stomp_expansion_board_mic_stomp_bin_end;


static volatile uint32_t * audioStatePtr;
#define UI_DMIN 1
#define ADC_LOWPASS 2
#define ROTARY_ENCODER_MAX_INCR 512
#define ROTARY_ENCODER_SPEED_FACTOR 32
const uint8_t switchesPins[2]={ENTER_SWITCH,EXIT_SWITCH};



void core1Main()
{
    initSystickTimer();
    
    audioStatePtr = getAudioStatePtr();



    #ifdef EXTENSION_BOARD
    #ifdef AVR_FLASHER
    initAvrProgrammer();
    int8_t firmwareMatch = matchAvrFirmwareVersion(AVR_SYNC_NUMBER);
    if (firmwareMatch == 0)
    {
        clearAvrFlash();
        uploadAvrFirmware((uint16_t*)&_binary___mic_stomp_expansion_board_mic_stomp_bin_start,((uint32_t)&_binary___mic_stomp_expansion_board_mic_stomp_bin_end-(uint32_t)&_binary___mic_stomp_expansion_board_mic_stomp_bin_start)>>1 );
        disableAvrProgrammingMode();
        waitSysticks(10);
    }
    #endif
    #endif

    initDisplay();

	/*
     *
     * Initialize Background Services
     *
	 */

	
	piPicoFxUiSetup();
	ClearDisplay();
    *DMA_INTE0 |= (1 << 4);

	#ifndef FORCE_TEST_MODE
		enterLevel0();
	#else
	    // switch on program "off"
		ui.currentProgramIdx = 2;
		ui.currentProgram=loadProgram(ui.currentProgramIdx);
	    enterLevel7();
	#endif

    // initalized the rotary encoder and the switches so that core 1 handler the interrupts of the ui elements
    initRotaryEncoder(switchesPins,2);

    initRoundRobinReading(); // internal adc for reading parameters

    setAsOutput(CLIPPING_LED_INPUT);
    setAsOutput(CLIPPING_LED_OUTPUT);
    setPin(CLIPPING_LED_INPUT,CLIPPING_LED_POLARITY);
    setPin(CLIPPING_LED_OUTPUT,CLIPPING_LED_POLARITY);

    #ifdef EXTENSION_BOARD
    initStompSwitchesInterface();
    setStompswitchColorRaw(0);
    #endif

    *NVIC_ISER = (1 << 16) | (1 << 23) | (1 << 11); 
    // enable interrupt for sio: FIR filteraudio processing, i2c: stomp extension and dma: display update of proc1     
    setInterruptPriority(11,1);
    *SIO_FIFO_ST = (1 << 2);
    *SIO_FIFO_WR=0xcafeface; // write sync word for core 0 to wait for core 1

    for(;;)
    {        
        if ((task & (1 << TASK_UPDATE_POTENTIOMETER_VALUES)) == (1 << TASK_UPDATE_POTENTIOMETER_VALUES))
        {
            // call the update function of the chosen program
            adcChannel = getChannel0Value();
            adcChannel0 = adcChannel0 + ((ADC_LOWPASS*(adcChannel - adcChannel0)) >> 8);
            if ((adcChannel0 > adcChannelOld0) && (adcChannel0-adcChannelOld0) > UI_DMIN )
            {
                onKnob0(adcChannel0);
                adcChannelOld0=adcChannel0;
            }
            else if ((adcChannel0 < adcChannelOld0) && (adcChannelOld0-adcChannel0) > UI_DMIN )
            {
                onKnob0(adcChannel0);
                adcChannelOld0=adcChannel0;
            }

            adcChannel = getChannel1Value();
            adcChannel1 = adcChannel1 + ((ADC_LOWPASS*(adcChannel - adcChannel1)) >> 8);
            if ((adcChannel1 > adcChannelOld1) && (adcChannel1-adcChannelOld1) > UI_DMIN )
            {
                onKnob1(adcChannel1);
                adcChannelOld1=adcChannel1;
            }
            else if ((adcChannel1 < adcChannelOld1) && (adcChannelOld1-adcChannel1) > UI_DMIN )
            {
                onKnob1(adcChannel1);
                adcChannelOld1=adcChannel1;
            }

            adcChannel = getChannel2Value();
            adcChannel2 = adcChannel2 + ((ADC_LOWPASS*(adcChannel - adcChannel2)) >> 8);
            if ((adcChannel2 > adcChannelOld2) && (adcChannel2-adcChannelOld2) > UI_DMIN )
            {
                onKnob2(adcChannel2);
                adcChannelOld2=adcChannel2;
            }
            else if ((adcChannel2 < adcChannelOld2) && (adcChannelOld2-adcChannel) > UI_DMIN )
            {
                onKnob2(adcChannel2);
                adcChannelOld2=adcChannel;
            }
            task &= ~(1 << TASK_UPDATE_POTENTIOMETER_VALUES);
        }
        if ((task & (1 << TASK_UPDATE_AUDIO_UI)) == (1 << TASK_UPDATE_AUDIO_UI))
        {
            avgOldInBfr = avgInOld >> 8;
            avgOldOutBfr = avgOutOld >> 8;
            cpuLoadBfr = (cpuLoad >> 1);
            onUpdate(avgOldInBfr,avgOldOutBfr,cpuLoadBfr);
            #ifndef FORCE_TEST_MODE
            if ((*audioStatePtr & (1 << AUDIO_STATE_INPUT_CLIPPED)) == (1 << AUDIO_STATE_INPUT_CLIPPED))
            {
                setPin(CLIPPING_LED_INPUT,CLIPPING_LED_POLARITY ^ 1);
                *audioStatePtr &= ~(1 << AUDIO_STATE_INPUT_CLIPPED);
            }
            else
            {
                setPin(CLIPPING_LED_INPUT,CLIPPING_LED_POLARITY);
            }
            if ((*audioStatePtr & (1 << AUDIO_STATE_OUTPUT_CLIPPED)) == (1 << AUDIO_STATE_OUTPUT_CLIPPED))
            {
                setPin(CLIPPING_LED_OUTPUT,CLIPPING_LED_POLARITY ^ 1);
                *audioStatePtr &= ~(1 << AUDIO_STATE_OUTPUT_CLIPPED);
            }
            else
            {
                setPin(CLIPPING_LED_OUTPUT,CLIPPING_LED_POLARITY);
            }
            #endif
            
            task &= ~(1 << TASK_UPDATE_AUDIO_UI);
        }

        if ((task & (1 << TASK_I2C_DATA_RECEIVED))!=0)
        {

            handleSwitchesUpdate(I2CGetReceivedData());
            task &= ~(1 << TASK_I2C_DATA_RECEIVED);
        }
        
        /*
         *
         * UI Switches Callback
         * 
        */

        
        switchVals[0] = getSwitchValue(0);
        if ((switchVals[0] & 1) > 0)
        {
            onEnterPressed();
            clearPressedStickyBit(0);
        }
        if((switchVals[0] & 2) > 0)
        {
            onEnterReleased();
            clearReleasedStickyBit(0);
        }

        switchVals[1] = getSwitchValue(1);
        if ((switchVals[1] & 1) > 0)
        {
            onExitPressed();
            clearPressedStickyBit(1);
        }
        if ((switchVals[1] & 2) > 0)
        {
            onExitReleased();
            clearReleasedStickyBit(1);
        }

        getStickyIncrementAndSpeed(&rotaryEncoderInfo);
        if (rotaryEncoderInfo.increment != 0)
        {
            int32_t d_enc; 
            #ifdef ENCODER_TUNE
            char chrbfr[32];
            chrbfr[0]=0;
            #endif
            if (rotaryEncoderInfo.speed == 0)
            {
                if (rotaryEncoderInfo.increment > 0)
                {
                    d_enc = 1;
                }
                else
                {
                    d_enc = -1;
                }
            }
            else 
            {
                d_enc = rotaryEncoderInfo.increment*rotaryEncoderInfo.speed*ROTARY_ENCODER_SPEED_FACTOR;
                if (d_enc > ROTARY_ENCODER_MAX_INCR)
                {
                    d_enc = ROTARY_ENCODER_MAX_INCR;
                }
                else if (d_enc < -ROTARY_ENCODER_MAX_INCR)
                {
                    d_enc = -ROTARY_ENCODER_MAX_INCR;
                }
                #ifdef ENCODER_TUNE
                appendToString(chrbfr,"d_time: ");
                printf(chrbfr);
                UInt32ToChar(rotaryEncoderInfo.deltaTime,chrbfr);
                printf(chrbfr);
                chrbfr[0]='\r';
                chrbfr[1]='\n';
                chrbfr[2]=0;
                printf(chrbfr);
                #endif
            }
            encoderDelta = (int16_t)d_enc;
            #ifdef ENCODER_TUNE
            appendToString(chrbfr, "enc delta: ");
            printf(chrbfr);
            Int16ToChar(encoderDelta,chrbfr);
            printf(chrbfr);
            chrbfr[0]='\r';
            chrbfr[1]='\n';
            chrbfr[2]=0;
            printf(chrbfr);
            #endif
            onRotaryChange(encoderDelta);
            clearStickyIncrementDelta();
        }
            

       /*
        *
        * Stomp Switches Callback
        * 
       */

        
        #ifdef EXTENSION_BOARD
        stompSwitchState = getStompSwitchState(0);
        if ((stompSwitchState & (1 << 1)) != 0) 
        {
            clearStompSwitchStickyPressed(0);
            onStompSwitch1Pressed();
        }
        if ((stompSwitchState & (1 << 2)) != 0)
        {
            clearStompSwitchStickyReleased(0);
            onStompSwitch1Released();
        }
        stompSwitchState = getStompSwitchState(1);
        if ((stompSwitchState & (1 << 1)) != 0) 
        {
            clearStompSwitchStickyPressed(1);
            onStompSwitch2Pressed();
        }
        if ((stompSwitchState & (1 << 2)) != 0)
        {
            clearStompSwitchStickyReleased(1);
            onStompSwitch2Released();
        }
        stompSwitchState = getStompSwitchState(2);
        if ((stompSwitchState & (1 << 1)) != 0) 
        {
            clearStompSwitchStickyPressed(2);
            onStompSwitch3Pressed();
        }
        if ((stompSwitchState & (1 << 2)) != 0)
        {
            clearStompSwitchStickyReleased(2);
            onStompSwitch3Released();
        }


        if (programChangeState == 3)
        {            
            if (programToInitialize != 0xFF)
            {
                delete ui.currentProgram;
                ui.currentProgram = loadProgram(programToInitialize);
                ui.currentParameterIdx = 0;
                ui.currentParameter = ui.currentProgram->getParameter(ui.currentParameterIdx);
                if (ui.currentProgram != nullptr)
                {
                    
                    if (currentPreset != 0xFF)
                    {
                        applyPreset(presets+currentPreset,ui.currentProgram);
                    }
                    
                    programChangeState = 4;
                }
                onCreate();
            }
            else
            {
                programChangeState = 4;
            }
        }
        #endif
        
    }
}

}